Revit 2027 API
InSessionPrintSetting.PrintParameters Property
Returns the Parameters of Print Setup.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual PrintParameters PrintParameters { get; }
Public Overridable ReadOnly Property PrintParameters As PrintParameters
	Get
public:
virtual property PrintParameters^ PrintParameters {
	PrintParameters^ get ();
}
abstract PrintParameters : PrintParameters with get
override PrintParameters : PrintParameters with get
Property Value
PrintParameters
Implements
IPrintSetting.PrintParameters
Remarks
The Parameters of Print Setup. Refer to the Print Setup dialog in Revit for details.
See Also
Reference
InSessionPrintSetting Class
Autodesk.Revit.DB Namespace